from astrbot.api.event import AstrMessageEvent
import astrbot.api.message_components as Comp
async def run_pet_animal_logic(event: AstrMessageEvent, curr_dir: str):
    msg = event.message_str
    pet_dict = {
        "🐱": "喵呜~ 亚托莉被摸得很舒服呢，高性能感应器捕捉到了温暖！",
        "🐶": "汪汪！它开心地围着你转圈，亚托莉也想和你一起玩！",
        "🐰": "唔...软绵绵的，像云朵一样！",
        "🦊": "嘿嘿，狐狸的尾巴大大的，摸起来好解压呀~",
        "🐼": "哇！是国宝！亚托莉居然摸到了大熊猫！",
        "🐹": "小仓鼠在亚托莉手心里缩成了一个小球，痒痒的，嘿嘿~",
        "🐥": "小鸡仔叽叽喳喳的，好萌呀！",
        "🐦": "小鸟停在亚托莉肩膀上了！嘘——我们要小声一点哦。",
        "🐧": "是一摇一摆的小企鹅！肚皮凉凉的，亚托莉的冷却系统都要过载了~",
        "🐑": "呜哇！软绵绵的羊毛，比亚托莉的坐垫还要舒服！",
        "🐴": "马儿的毛摸起来很顺滑呢，这就是所谓的‘丝滑性能’吗？",
        "🐷": "小猪的鼻子粉粉嫩嫩的，还会发出哼哼声，太有趣了！",
        "🐘": "哇！大象的皮肤虽然皱皱的，但摸起来很有厚实感！",
        "🐨": "考拉一直抱着亚托莉不撒手，它是把亚托莉当成树了吗？",
        "🦙": "羊驼的毛好长呀！不过...它刚才是不是在瞄准亚托莉的头？",
        "🦉": "哇！猫头鹰的头居然能转 270 度！高性能...比亚托莉还要灵活！",
        "🦦": "水獭在搓脸脸诶！亚托莉也要跟着它一起搓~",
        "🦆": "嘎嘎！小鸭子的羽毛防水性能真好，亚托莉好羡慕呀！",
        "🐯": "大...大脑虎！虽然亚托莉手心在冒汗，但摸起来很威风！"
    }
    if msg not in pet_dict:
        return;
    text=pet_dict[msg]
    yield event.plain_result(text)
    return
